<?php
// +----------------------------------------------------------------------
// | ThinkSmscode [smscode package for thinkphp]
// +----------------------------------------------------------------------
// | ThinkPHP短信验证码扩展
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: axguowen <axguowen@qq.com>
// +----------------------------------------------------------------------

return [
    // 验证码位数
    'length' => 6,
    // 验证码有效期
    'expire' => 900,
    // 短信平台设置，可配置多个平台，会随机排序后按顺序发送，直到发送成功为止
    // 键为短信平台名称
    // 值为模板ID，留空则使用sms扩展配置的默认模板ID
    'platforms' => [],
];
